import { Router } from 'express';

const categoriesRouter = Router();

const CATEGORIES = {
  "Молочные продукты": ["Все", "Молоко и сливки", "Растительное молоко", "Сыры", "Яйца", "Йогурт и сметана", "Творог", "Кефир, айран, тан", "Масло, маргарин", "Творожки и десерты", "Сырки и бисквиты", "Молочные коктейли", "Сгущённое молоко", "Творожная масса", "Курт, жент, балкаймак", "Сухое молоко, сливки", "Закваски", "Протеиновые"],
  "Овощи и фрукты": ["Все", "Овощи", "Фрукты", "Зелень", "Грибы", "Ягоды"],
  "Хлеб и выпечка": ["Все", "Хлеб", "Булочки", "Пироги", "Торты", "Печенье"],
  "Мясо и птица": ["Все", "Говядина", "Свинина", "Курица", "Индейка", "Фарш", "Колбасы"],
  "Рыба и морепродукты": ["Все", "Рыба свежая", "Рыба замороженная", "Морепродукты", "Икра"],
  "Бакалея": ["Все", "Крупы", "Макароны", "Мука", "Сахар", "Соль", "Масло растительное", "Консервы"],
  "Напитки": ["Все", "Вода", "Соки", "Газировка", "Чай", "Кофе"],
  "Сладости": ["Все", "Шоколад", "Конфеты", "Печенье", "Вафли", "Мороженое"]
};

categoriesRouter.get('/categories', (req, res) => {
  res.json(CATEGORIES);
});

export { categoriesRouter };
